# non-Windows favourites go here
# for full-cross-platform favourites, rely on jokeyrhyme-dotfiles

brew "bash"
brew "fish"
brew "git-extras"
brew "gnupg"
brew "lynis"
brew "neofetch"
brew "pandoc" # needed for checkmake
brew "tmux"
brew "zsh"

tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "linuxbrew/fonts"

brew "font-cascadia"
brew "font-comic-neue"
brew "font-fira-code"
brew "font-fira-mono"
brew "font-fira-sans"
brew "font-hack"
brew "font-hasklig"
brew "font-inter"
brew "font-jetbrains-mono"
brew "font-overpass"
brew "font-public-sans"
# brew "font-sans-forgetica" # possible issues with linuxbrew?
brew "font-source-code-pro"
brew "font-source-sans-pro"
brew "font-source-serif-pro"
