# non-Windows favourites go here
# for full-cross-platform favourites, rely on jokeyrhyme-dotfiles

brew "bash"
brew "fish"
brew "git-extras"
brew "gnupg"
brew "lynis"
brew "neofetch"
brew "pandoc" # needed for checkmake
brew "tmux"
brew "zsh"

tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "linuxbrew/fonts"

cask "font-cascadia"
cask "font-comic-neue"
cask "font-fira-code"
cask "font-fira-mono"
cask "font-fira-sans"
cask "font-hack"
cask "font-hasklig"
cask "font-inter"
cask "font-jetbrains-mono"
cask "font-overpass"
cask "font-public-sans"
cask "font-sans-forgetica"
cask "font-source-code-pro"
cask "font-source-sans-pro"
cask "font-source-serif-pro"
